results/factorial-final/security-overhead-final-tls-broker5/security-overhead-final-factorial-tls-b5-rf3-isr3-msg1024-tps10000-batch131072-acks1-prod6-compnone-trial3/producer-perf.log
run_id=security-overhead-final-factorial-tls-b5-rf3-isr3-msg1024-tps10000-batch131072-acks1-prod6-compnone-trial3
producer_count=6
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg1024-tps10000-batch131072-acks1-prod6-compnone-trial3/producer-perf-1.log -----
producer_index=1
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 8797.0 ms avg latency, 8797.0 ms max latency.
9702 records sent, 1878.0 records/sec (1.83 MB/sec), 3970.5 ms avg latency, 5276.0 ms max latency.
16667 records sent, 1073.005858 records/sec (1.05 MB/sec), 4480.88 ms avg latency, 8797.00 ms max latency, 4823 ms 50th, 5514 ms 95th, 5597 ms 99th, 5628 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg1024-tps10000-batch131072-acks1-prod6-compnone-trial3/producer-perf-2.log -----
producer_index=2
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 8386.0 ms avg latency, 8386.0 ms max latency.
7686 records sent, 1534.4 records/sec (1.50 MB/sec), 3647.9 ms avg latency, 4999.0 ms max latency.
16667 records sent, 1071.626053 records/sec (1.05 MB/sec), 4469.02 ms avg latency, 8386.00 ms max latency, 4728 ms 50th, 5739 ms 95th, 5869 ms 99th, 5875 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg1024-tps10000-batch131072-acks1-prod6-compnone-trial3/producer-perf-3.log -----
producer_index=3
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 9177.0 ms avg latency, 9177.0 ms max latency.
12978 records sent, 2594.6 records/sec (2.53 MB/sec), 4137.0 ms avg latency, 5443.0 ms max latency.
16667 records sent, 1110.171185 records/sec (1.08 MB/sec), 4429.64 ms avg latency, 9177.00 ms max latency, 4570 ms 50th, 5625 ms 95th, 5668 ms 99th, 5680 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg1024-tps10000-batch131072-acks1-prod6-compnone-trial3/producer-perf-4.log -----
producer_index=4
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 7409.0 ms avg latency, 7409.0 ms max latency.
7056 records sent, 1407.3 records/sec (1.37 MB/sec), 3608.2 ms avg latency, 4957.0 ms max latency.
16667 records sent, 1120.922725 records/sec (1.09 MB/sec), 4521.87 ms avg latency, 7409.00 ms max latency, 4721 ms 50th, 5913 ms 95th, 6239 ms 99th, 6263 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg1024-tps10000-batch131072-acks1-prod6-compnone-trial3/producer-perf-5.log -----
producer_index=5
producer_count=6
producer_records=16666
producer_throughput=1666
1 records sent, 0.1 records/sec (0.00 MB/sec), 8561.0 ms avg latency, 8561.0 ms max latency.
10080 records sent, 1971.8 records/sec (1.93 MB/sec), 4037.5 ms avg latency, 5819.0 ms max latency.
16666 records sent, 1095.654461 records/sec (1.07 MB/sec), 4640.43 ms avg latency, 8561.00 ms max latency, 4819 ms 50th, 6152 ms 95th, 6317 ms 99th, 6447 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b5-rf3-isr3-msg1024-tps10000-batch131072-acks1-prod6-compnone-trial3/producer-perf-6.log -----
producer_index=6
producer_count=6
producer_records=16666
producer_throughput=1666
1 records sent, 0.1 records/sec (0.00 MB/sec), 8348.0 ms avg latency, 8348.0 ms max latency.
10080 records sent, 1943.7 records/sec (1.90 MB/sec), 3582.9 ms avg latency, 4937.0 ms max latency.
16666 records sent, 1107.228275 records/sec (1.08 MB/sec), 4121.35 ms avg latency, 8348.00 ms max latency, 4247 ms 50th, 5369 ms 95th, 5463 ms 99th, 5587 ms 99.9th.